; domain
(define (domain robot_waiter)

    (:requirements :strips :typing :disjunctive-preconditions :negative-preconditions)

    (:types
    plate - object
    area - position
    costumer - object
    )

    (:predicates
    (adjacent ?a1 - area ?a2 - area)       ;Wether area a1 and a2 are adjacent and not seperated
    (has_food ?p - plate)              ;Wether plate p contains food 
    (served ?c - costumer)             ;Wether costumer c has been served
    (holding ?p - plate)            ;Wether Lucki is holding plate p
    (hands_full)                        ;Whether Lucki is holding any plate
    (buffet_location ?a - area)            ;Wether the buffet is in area a
    (robot_at ?a - area)                  ;Wether the robot is in area a
    (plate_at ?p - plate ?a - area)     ;Wether the plate p is in area a
    (customer_at ?c - costumer ?a - area)  ;Wether the costumer c is in area a
    )


    ; ------ ACTIONS ------
    (:action move ;This action moves the robot from a1 to a2 
    :parameters (?a1 - area ?a2 - area)
    :precondition (and
        (robot_at ?a1)
        (or (adjacent ?a1 ?a2) (adjacent ?a2 ?a1))
    )
    :effect (and
        (not (robot_at ?a1))
        (robot_at ?a2)
    )
    )

    (:action pick_up ;This action lets the robot pick up the plate p in the area a 
        :parameters (?p - plate ?a - area)
        :precondition (and
            (robot_at ?a)
            (plate_at ?p ?a)
            (not (hands_full))
        )
        :effect (and
            (holding ?p)
            (hands_full)
            (not (plate_at ?p ?a))
        )
    )

    (:action present ;This action lets the robot present the plate p to the costumer c in area a
        :parameters (?p - plate ?c - costumer ?a - area)
        :precondition (and
            (holding ?p)
            (has_food ?p)
            (robot_at ?a)
            (customer_at ?c ?a)
            (not (served ?c))
        )
        :effect (and
            (served ?c)
            (not (holding ?p))
            (not (hands_full))
        )
    )

    (:action fill ;This action lets the robot fill the plate p in the area a
        :parameters (?p - plate ?a - area)
        :precondition (and
            (holding ?p)
            (not (has_food ?p))
            (robot_at ?a)
            (buffet_location ?a)
        )
        :effect (and
            (has_food ?p)
        )
    )
)

; problem
(define (problem more_walls)
    (:domain robot_waiter
    )
    (:objects
    c1 c2 c3 c4 - costumer
    p1 p2 p3 p4 - plate
    bta aua pua pma ama pla ala - area
    )

    (:init
    (adjacent bta aua) 
    (adjacent aua bta) 
    (adjacent aua ama) 
    (adjacent ama aua) 
    (adjacent pua pma) 
    (adjacent pma pua) 
    (adjacent pla pma) 
    (adjacent pma pla) 
    (adjacent pla ala) 
    (adjacent ala pla) 
    (adjacent pma ama)
    (adjacent ama pma)
    (buffet_location bta)
    (customer_at c1 pma) (customer_at c2 pua) (customer_at c3 ama) (customer_at c4 ala)
    (robot_at bta)
    (plate_at p1 bta) (plate_at p2 bta) (plate_at p3 bta) (plate_at p4 bta)
    )

    (:goal
        (and
            (served c1) (served c2) (served c3) (served c4)
            (robot_at bta)
        )
    )
)

; plan
1. (pick_up p1 bta)
   deleted: (plate_at p1 bta)
   added: (holding p1) (hands_full)
   goals met: 1 of 5
2. (fill p1 bta)
   added: (has_food p1)
   goals met: 1 of 5
3. (move bta aua)
   deleted: (robot_at bta)
   added: (robot_at aua)
   goals met: 0 of 5
4. (move aua ama)
   deleted: (robot_at aua)
   added: (robot_at ama)
   goals met: 0 of 5
5. (present p1 c3 ama)
   deleted: (holding p1) (hands_full)
   added: (served c3)
   goals met: 1 of 5
6. (move ama aua)
   deleted: (robot_at ama)
   added: (robot_at aua)
   goals met: 1 of 5
7. (move aua bta)
   deleted: (robot_at aua)
   added: (robot_at bta)
   goals met: 2 of 5
8. (pick_up p4 bta)
   deleted: (plate_at p4 bta)
   added: (holding p4) (hands_full)
   goals met: 2 of 5
9. (fill p4 bta)
   added: (has_food p4)
   goals met: 2 of 5
10. (move bta aua)
   deleted: (robot_at bta)
   added: (robot_at aua)
   goals met: 1 of 5
11. (move aua ama)
   deleted: (robot_at aua)
   added: (robot_at ama)
   goals met: 1 of 5
12. (move ama pma)
   deleted: (robot_at ama)
   added: (robot_at pma)
   goals met: 1 of 5
13. (present p4 c1 pma)
   deleted: (holding p4) (hands_full)
   added: (served c1)
   goals met: 2 of 5
14. (move pma ama)
   deleted: (robot_at pma)
   added: (robot_at ama)
   goals met: 2 of 5
15. (move ama aua)
   deleted: (robot_at ama)
   added: (robot_at aua)
   goals met: 2 of 5
16. (move aua bta)
   deleted: (robot_at aua)
   added: (robot_at bta)
   goals met: 3 of 5
17. (pick_up p3 bta)
   deleted: (plate_at p3 bta)
   added: (holding p3) (hands_full)
   goals met: 3 of 5
18. (fill p3 bta)
   added: (has_food p3)
   goals met: 3 of 5
19. (move bta aua)
   deleted: (robot_at bta)
   added: (robot_at aua)
   goals met: 2 of 5
20. (move aua ama)
   deleted: (robot_at aua)
   added: (robot_at ama)
   goals met: 2 of 5
21. (move ama pma)
   deleted: (robot_at ama)
   added: (robot_at pma)
   goals met: 2 of 5
22. (move pma pua)
   deleted: (robot_at pma)
   added: (robot_at pua)
   goals met: 2 of 5
23. (present p3 c2 pua)
   deleted: (holding p3) (hands_full)
   added: (served c2)
   goals met: 3 of 5
24. (move pua pma)
   deleted: (robot_at pua)
   added: (robot_at pma)
   goals met: 3 of 5
25. (move pma ama)
   deleted: (robot_at pma)
   added: (robot_at ama)
   goals met: 3 of 5
26. (move ama aua)
   deleted: (robot_at ama)
   added: (robot_at aua)
   goals met: 3 of 5
27. (move aua bta)
   deleted: (robot_at aua)
   added: (robot_at bta)
   goals met: 4 of 5
28. (pick_up p2 bta)
   deleted: (plate_at p2 bta)
   added: (holding p2) (hands_full)
   goals met: 4 of 5
29. (fill p2 bta)
   added: (has_food p2)
   goals met: 4 of 5
30. (move bta aua)
   deleted: (robot_at bta)
   added: (robot_at aua)
   goals met: 3 of 5
31. (move aua ama)
   deleted: (robot_at aua)
   added: (robot_at ama)
   goals met: 3 of 5
32. (move ama pma)
   deleted: (robot_at ama)
   added: (robot_at pma)
   goals met: 3 of 5
33. (move pma pla)
   deleted: (robot_at pma)
   added: (robot_at pla)
   goals met: 3 of 5
34. (move pla ala)
   deleted: (robot_at pla)
   added: (robot_at ala)
   goals met: 3 of 5
35. (present p2 c4 ala)
   deleted: (holding p2) (hands_full)
   added: (served c4)
   goals met: 4 of 5
36. (move ala pla)
   deleted: (robot_at ala)
   added: (robot_at pla)
   goals met: 4 of 5
37. (move pla pma)
   deleted: (robot_at pla)
   added: (robot_at pma)
   goals met: 4 of 5
38. (move pma ama)
   deleted: (robot_at pma)
   added: (robot_at ama)
   goals met: 4 of 5
39. (move ama aua)
   deleted: (robot_at ama)
   added: (robot_at aua)
   goals met: 4 of 5
40. (move aua bta)
   deleted: (robot_at aua)
   added: (robot_at bta)
   goals met: 5 of 5
